tiacsys/bridle/include/zephyr/dt-bindings/pinctrl/ch32x035-pinctrl.h
/*
 * Copyright (c) 2025 TiaC Systems
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_CH32X035_PINCTRL_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_CH32X035_PINCTRL_H_

#define CH32X035_PINMUX_PORT_PA 0
#define CH32X035_PINMUX_PORT_PB 1
#define CH32X035_PINMUX_PORT_PC 2

/* Starting bit for the remap field in PCFR1 */
#define CH32X035_PINMUX_SPI1_RM    0
#define CH32X035_PINMUX_I2C1_RM    2
#define CH32X035_PINMUX_USART1_RM  5
#define CH32X035_PINMUX_USART2_RM  7
#define CH32X035_PINMUX_USART3_RM  10
#define CH32X035_PINMUX_USART4_RM  12
#define CH32X035_PINMUX_TIM1_RM    15
#define CH32X035_PINMUX_TIM2_RM    18
#define CH32X035_PINMUX_TIM3_RM    21
#define CH32X035_PINMUX_PIOC_RM    23
#define CH32X035_PINMUX_SDI_RM     24

/* Port number with 0-2 */
#define CH32X035_PINCTRL_PORT_SHIFT    0
#define CH32X035_PINCTRL_PORT_MASK     GENMASK(1, 0)
/* Pin number 0-23 */
#define CH32X035_PINCTRL_PIN_SHIFT     2
#define CH32X035_PINCTRL_PIN_MASK      GENMASK(6, 2)
/* Base remap bit 0-31 */
#define CH32X035_PINCTRL_RM_BASE_SHIFT 7
#define CH32X035_PINCTRL_RM_BASE_MASK  GENMASK(11, 7)
/* Function remapping ID 0-7 */
#define CH32X035_PINCTRL_RM_SHIFT      12
#define CH32X035_PINCTRL_RM_MASK       GENMASK(14, 12)

#define CH32X035_PINMUX_DEFINE(port, pin, rm, remapping)                        \
	((CH32X035_PINMUX_PORT_##port << CH32X035_PINCTRL_PORT_SHIFT) |         \
	 (pin << CH32X035_PINCTRL_PIN_SHIFT) |                                  \
	 (CH32X035_PINMUX_##rm##_RM << CH32X035_PINCTRL_RM_BASE_SHIFT) |        \
	 (remapping << CH32X035_PINCTRL_RM_SHIFT))

/* Pin swaps.
 * Warning: Some of those do not apply to all packages.
 * Verify using reference manual and use CH32X035_PINMUX_DEFINE directly if needed.
 */

#define SPI1_NSS_PA4_0   CH32X035_PINMUX_DEFINE(PA, 4, SPI1, 0)
#define SPI1_NSS_PB21_1  CH32X035_PINMUX_DEFINE(PB, 21, SPI1, 1)
#define SPI1_NSS_PA12_2  CH32X035_PINMUX_DEFINE(PA, 12, SPI1, 2)
#define SPI1_NSS_PC4_3   CH32X035_PINMUX_DEFINE(PC, 4, SPI1, 3)
#define SPI1_SCK_PA5_0   CH32X035_PINMUX_DEFINE(PA, 5, SPI1, 0)
#define SPI1_SCK_PB15_1  CH32X035_PINMUX_DEFINE(PB, 15, SPI1, 1)
#define SPI1_SCK_PA11_2  CH32X035_PINMUX_DEFINE(PA, 11, SPI1, 2)
#define SPI1_SCK_PC5_3   CH32X035_PINMUX_DEFINE(PC, 5, SPI1, 3)
#define SPI1_MISO_PA6_0  CH32X035_PINMUX_DEFINE(PA, 6, SPI1, 0)
#define SPI1_MISO_PA8_1  CH32X035_PINMUX_DEFINE(PA, 8, SPI1, 1)
#define SPI1_MISO_PA9_2  CH32X035_PINMUX_DEFINE(PA, 9, SPI1, 2)
#define SPI1_MISO_PC6_3  CH32X035_PINMUX_DEFINE(PC, 6, SPI1, 3)
#define SPI1_MOSI_PA7_0  CH32X035_PINMUX_DEFINE(PA, 7, SPI1, 0)
#define SPI1_MOSI_PA9_1  CH32X035_PINMUX_DEFINE(PA, 9, SPI1, 1)
#define SPI1_MOSI_PA10_2 CH32X035_PINMUX_DEFINE(PA, 10, SPI1, 2)
#define SPI1_MOSI_PC7_3  CH32X035_PINMUX_DEFINE(PC, 7, SPI1, 3)

#define I2C1_SCL_PA10_0 CH32X035_PINMUX_DEFINE(PA, 10, I2C1, 0)
#define I2C1_SCL_PA13_1 CH32X035_PINMUX_DEFINE(PA, 13, I2C1, 1)
#define I2C1_SCL_PC16_2 CH32X035_PINMUX_DEFINE(PC, 16, I2C1, 2)
#define I2C1_SCL_PC19_3 CH32X035_PINMUX_DEFINE(PC, 19, I2C1, 3)
#define I2C1_SCL_PC17_4 CH32X035_PINMUX_DEFINE(PC, 17, I2C1, 4)
#define I2C1_SCL_PC18_5 CH32X035_PINMUX_DEFINE(PC, 18, I2C1, 5)
#define I2C1_SDA_PA11_0 CH32X035_PINMUX_DEFINE(PA, 11, I2C1, 0)
#define I2C1_SDA_PA14_1 CH32X035_PINMUX_DEFINE(PA, 14, I2C1, 1)
#define I2C1_SDA_PC17_2 CH32X035_PINMUX_DEFINE(PC, 17, I2C1, 2)
#define I2C1_SDA_PC18_3 CH32X035_PINMUX_DEFINE(PC, 18, I2C1, 3)
#define I2C1_SDA_PC16_4 CH32X035_PINMUX_DEFINE(PC, 16, I2C1, 4)
#define I2C1_SDA_PC19_5 CH32X035_PINMUX_DEFINE(PC, 19, I2C1, 5)

#define USART1_CK_PB9_0   CH32X035_PINMUX_DEFINE(PB, 9, USART1, 0)
#define USART1_CK_PB9_1   CH32X035_PINMUX_DEFINE(PB, 9, USART1, 1)
#define USART1_CK_PB5_2   CH32X035_PINMUX_DEFINE(PB, 5, USART1, 2)
#define USART1_CK_PB12_3  CH32X035_PINMUX_DEFINE(PB, 12, USART1, 3)
#define USART1_TX_PB10_0  CH32X035_PINMUX_DEFINE(PB, 10, USART1, 0)
#define USART1_TX_PA10_1  CH32X035_PINMUX_DEFINE(PA, 10, USART1, 1)
#define USART1_TX_PB10_2  CH32X035_PINMUX_DEFINE(PB, 10, USART1, 2)
#define USART1_TX_PA7_3   CH32X035_PINMUX_DEFINE(PB, 7, USART1, 3)
#define USART1_RX_PB11_0  CH32X035_PINMUX_DEFINE(PB, 11, USART1, 0)
#define USART1_RX_PA11_1  CH32X035_PINMUX_DEFINE(PA, 11, USART1, 1)
#define USART1_RX_PB11_2  CH32X035_PINMUX_DEFINE(PB, 11, USART1, 2)
#define USART1_RX_PB2_3   CH32X035_PINMUX_DEFINE(PB, 2, USART1, 3)
#define USART1_CTS_PC16_0 CH32X035_PINMUX_DEFINE(PC, 16, USART1, 0)
#define USART1_CTS_PC16_1 CH32X035_PINMUX_DEFINE(PC, 16, USART1, 1)
#define USART1_CTS_PA9_2  CH32X035_PINMUX_DEFINE(PA, 9, USART1, 2)
#define USART1_CTS_PA13_3 CH32X035_PINMUX_DEFINE(PA, 13, USART1, 3)
#define USART1_RTS_PC17_0 CH32X035_PINMUX_DEFINE(PC, 17, USART1, 0)
#define USART1_RTS_PC17_1 CH32X035_PINMUX_DEFINE(PC, 17, USART1, 1)
#define USART1_RTS_PA8_2  CH32X035_PINMUX_DEFINE(PA, 8, USART1, 2)
#define USART1_RTS_PA14_3 CH32X035_PINMUX_DEFINE(PA, 14, USART1, 3)

#define USART2_CK_PA4_0   CH32X035_PINMUX_DEFINE(PA, 4, USART2, 0)
#define USART2_CK_PA23_1  CH32X035_PINMUX_DEFINE(PA, 23, USART2, 1)
#define USART2_CK_PA22_2  CH32X035_PINMUX_DEFINE(PA, 22, USART2, 2)
#define USART2_CK_PB20_3  CH32X035_PINMUX_DEFINE(PB, 20, USART2, 3)
#define USART2_CK_PA22_4  CH32X035_PINMUX_DEFINE(PA, 22, USART2, 4)
#define USART2_TX_PA2_0   CH32X035_PINMUX_DEFINE(PA, 2, USART2, 0)
#define USART2_TX_PA20_1  CH32X035_PINMUX_DEFINE(PA, 20, USART2, 1)
#define USART2_TX_PA15_2  CH32X035_PINMUX_DEFINE(PA, 15, USART2, 2)
#define USART2_TX_PC0_3   CH32X035_PINMUX_DEFINE(PC, 0, USART2, 3)
#define USART2_TX_PA15_4  CH32X035_PINMUX_DEFINE(PA, 15, USART2, 4)
#define USART2_RX_PA3_0   CH32X035_PINMUX_DEFINE(PA, 3, USART2, 0)
#define USART2_RX_PA19_1  CH32X035_PINMUX_DEFINE(PA, 19, USART2, 1)
#define USART2_RX_PA16_2  CH32X035_PINMUX_DEFINE(PA, 16, USART2, 2)
#define USART2_RX_PC1_3   CH32X035_PINMUX_DEFINE(PC, 1, USART2, 3)
#define USART2_RX_PA16_4  CH32X035_PINMUX_DEFINE(PA, 16, USART2, 4)
#define USART2_CTS_PA0_0  CH32X035_PINMUX_DEFINE(PA, 0, USART2, 0)
#define USART2_CTS_PA1_1  CH32X035_PINMUX_DEFINE(PA, 1, USART2, 1)
#define USART2_CTS_PA17_2 CH32X035_PINMUX_DEFINE(PA, 17, USART2, 2)
#define USART2_CTS_PC2_3  CH32X035_PINMUX_DEFINE(PC, 2, USART2, 3)
#define USART2_CTS_PA17_4 CH32X035_PINMUX_DEFINE(PA, 17, USART2, 4)
#define USART2_RTS_PA1_0  CH32X035_PINMUX_DEFINE(PA, 1, USART2, 0)
#define USART2_RTS_PA2_1  CH32X035_PINMUX_DEFINE(PA, 2, USART2, 1)
#define USART2_RTS_PA21_2 CH32X035_PINMUX_DEFINE(PA, 21, USART2, 2)
#define USART2_RTS_PC3_3  CH32X035_PINMUX_DEFINE(PC, 3, USART2, 3)
#define USART2_RTS_PC3_4  CH32X035_PINMUX_DEFINE(PC, 3, USART2, 4)

#define USART3_CK_PB5_0   CH32X035_PINMUX_DEFINE(PB, 5, USART3, 0)
#define USART3_CK_PB5_1   CH32X035_PINMUX_DEFINE(PB, 5, USART3, 1)
#define USART3_CK_PB8_2   CH32X035_PINMUX_DEFINE(PB, 8, USART3, 2)
#define USART3_TX_PB3_0   CH32X035_PINMUX_DEFINE(PB, 3, USART3, 0)
#define USART3_TX_PC18_1  CH32X035_PINMUX_DEFINE(PC, 18, USART3, 1)
#define USART3_TX_PA18_2  CH32X035_PINMUX_DEFINE(PA, 18, USART3, 2)
#define USART3_TX_PB16_3  CH32X035_PINMUX_DEFINE(PB, 16, USART3, 3)
#define USART3_RX_PB4_0   CH32X035_PINMUX_DEFINE(PB, 4, USART3, 0)
#define USART3_RX_PC19_1  CH32X035_PINMUX_DEFINE(PC, 19, USART3, 1)
#define USART3_RX_PB14_2  CH32X035_PINMUX_DEFINE(PB, 14, USART3, 2)
#define USART3_RX_PB17_3  CH32X035_PINMUX_DEFINE(PB, 17, USART3, 3)
#define USART3_CTS_PB6_0  CH32X035_PINMUX_DEFINE(PB, 6, USART3, 0)
#define USART3_CTS_PB6_1  CH32X035_PINMUX_DEFINE(PB, 6, USART3, 1)
#define USART3_CTS_PA3_2  CH32X035_PINMUX_DEFINE(PA, 3, USART3, 2)
#define USART3_CTS_PB18_3 CH32X035_PINMUX_DEFINE(PB, 18, USART3, 3)
#define USART3_RTS_PB7_0  CH32X035_PINMUX_DEFINE(PB, 7, USART3, 0)
#define USART3_RTS_PB7_1  CH32X035_PINMUX_DEFINE(PB, 7, USART3, 1)
#define USART3_RTS_PA4_2  CH32X035_PINMUX_DEFINE(PA, 4, USART3, 2)
#define USART3_RTS_PB19_3 CH32X035_PINMUX_DEFINE(PB, 19, USART3, 3)

#define USART4_CK_PB2_0   CH32X035_PINMUX_DEFINE(PB, 2, USART4, 0)
#define USART4_CK_PA6_1   CH32X035_PINMUX_DEFINE(PA, 6, USART4, 1)
#define USART4_CK_PB2_2   CH32X035_PINMUX_DEFINE(PB, 2, USART4, 2)
#define USART4_CK_PB8_3   CH32X035_PINMUX_DEFINE(PB, 8, USART4, 3)
#define USART4_CK_PA8_4   CH32X035_PINMUX_DEFINE(PA, 8, USART4, 4)
#define USART4_CK_PB2_5   CH32X035_PINMUX_DEFINE(PB, 2, USART4, 5)
#define USART4_TX_PB0_0   CH32X035_PINMUX_DEFINE(PB, 0, USART4, 0)
#define USART4_TX_PA5_1   CH32X035_PINMUX_DEFINE(PA, 5, USART4, 1)
#define USART4_TX_PC16_2  CH32X035_PINMUX_DEFINE(PC, 16, USART4, 2)
#define USART4_TX_PB9_3   CH32X035_PINMUX_DEFINE(PB, 9, USART4, 3)
#define USART4_TX_PB13_4  CH32X035_PINMUX_DEFINE(PB, 13, USART4, 4)
#define USART4_TX_PC17_5  CH32X035_PINMUX_DEFINE(PC, 17, USART4, 5)
#define USART4_RX_PB1_0   CH32X035_PINMUX_DEFINE(PB, 1, USART4, 0)
#define USART4_RX_PA9_1   CH32X035_PINMUX_DEFINE(PA, 9, USART4, 1)
#define USART4_RX_PC17_2  CH32X035_PINMUX_DEFINE(PC, 17, USART4, 2)
#define USART4_RX_PA10_3  CH32X035_PINMUX_DEFINE(PA, 10, USART4, 3)
#define USART4_RX_PC19_4  CH32X035_PINMUX_DEFINE(PC, 19, USART4, 4)
#define USART4_RX_PC16_5  CH32X035_PINMUX_DEFINE(PC, 16, USART4, 5)
#define USART4_CTS_PB15_0 CH32X035_PINMUX_DEFINE(PB, 15, USART4, 0)
#define USART4_CTS_PA7_1  CH32X035_PINMUX_DEFINE(PA, 7, USART4, 1)
#define USART4_CTS_PB15_2 CH32X035_PINMUX_DEFINE(PB, 15, USART4, 2)
#define USART4_CTS_PA14_3 CH32X035_PINMUX_DEFINE(PA, 14, USART4, 3)
#define USART4_CTS_PA5_4  CH32X035_PINMUX_DEFINE(PA, 5, USART4, 4)
#define USART4_CTS_PB15_5 CH32X035_PINMUX_DEFINE(PB, 15, USART4, 5)
#define USART4_RTS_PA8_0  CH32X035_PINMUX_DEFINE(PA, 8, USART4, 0)
#define USART4_RTS_PB21_1 CH32X035_PINMUX_DEFINE(PB, 21, USART4, 1)
#define USART4_RTS_PA8_2  CH32X035_PINMUX_DEFINE(PA, 8, USART4, 2)
#define USART4_RTS_PA13_3 CH32X035_PINMUX_DEFINE(PA, 13, USART4, 3)
#define USART4_RTS_PA6_4  CH32X035_PINMUX_DEFINE(PA, 6, USART4, 4)
#define USART4_RTS_PA8_5  CH32X035_PINMUX_DEFINE(PA, 8, USART4, 5)

#define TIM1_ETR_PC17_0 CH32X035_PINMUX_DEFINE(PC, 17, TIM1, 0)
#define TIM1_ETR_PC17_1 CH32X035_PINMUX_DEFINE(PC, 17, TIM1, 1)
#define TIM1_ETR_PC18_2 CH32X035_PINMUX_DEFINE(PC, 18, TIM1, 2)
#define TIM1_ETR_PC18_3 CH32X035_PINMUX_DEFINE(PC, 18, TIM1, 3)
#define TIM1_ETR_PC15_4 CH32X035_PINMUX_DEFINE(PC, 15, TIM1, 4)
#define TIM1_CH1_PB9_0  CH32X035_PINMUX_DEFINE(PB, 9, TIM1, 0)
#define TIM1_CH1_PB9_1  CH32X035_PINMUX_DEFINE(PB, 9, TIM1, 1)
#define TIM1_CH1_PB9_2  CH32X035_PINMUX_DEFINE(PB, 9, TIM1, 2)
#define TIM1_CH1_PC0_3  CH32X035_PINMUX_DEFINE(PC, 0, TIM1, 3)
#define TIM1_CH2_PB10_0 CH32X035_PINMUX_DEFINE(PB, 10, TIM1, 0)
#define TIM1_CH2_PB10_1 CH32X035_PINMUX_DEFINE(PB, 10, TIM1, 1)
#define TIM1_CH2_PB10_2 CH32X035_PINMUX_DEFINE(PB, 10, TIM1, 2)
#define TIM1_CH2_PC1_3  CH32X035_PINMUX_DEFINE(PC, 1, TIM1, 3)
#define TIM1_CH3_PB11_0 CH32X035_PINMUX_DEFINE(PB, 11, TIM1, 0)
#define TIM1_CH3_PB11_1 CH32X035_PINMUX_DEFINE(PB, 11, TIM1, 1)
#define TIM1_CH3_PB11_2 CH32X035_PINMUX_DEFINE(PB, 11, TIM1, 2)
#define TIM1_CH3_PC2_3  CH32X035_PINMUX_DEFINE(PC, 2, TIM1, 3)
#define TIM1_CH3_PC14_4 CH32X035_PINMUX_DEFINE(PC, 14, TIM1, 4)
#define TIM1_CH4_PC16_0 CH32X035_PINMUX_DEFINE(PC, 16, TIM1, 0)
#define TIM1_CH4_PC16_1 CH32X035_PINMUX_DEFINE(PC, 16, TIM1, 1)
#define TIM1_CH4_PB12_2 CH32X035_PINMUX_DEFINE(PB, 12, TIM1, 2)
#define TIM1_CH4_PC3_3  CH32X035_PINMUX_DEFINE(PC, 3, TIM1, 3)
#define TIM1_BKIN_PB5_0 CH32X035_PINMUX_DEFINE(PB, 5, TIM1, 0)
#define TIM1_BKIN_PA6_1 CH32X035_PINMUX_DEFINE(PA, 6, TIM1, 1)
#define TIM1_BKIN_PB5_2 CH32X035_PINMUX_DEFINE(PB, 5, TIM1, 2)
#define TIM1_BKIN_PC4_3 CH32X035_PINMUX_DEFINE(PC, 4, TIM1, 3)
#define TIM1_CH1N_PB6_0 CH32X035_PINMUX_DEFINE(PB, 6, TIM1, 0)
#define TIM1_CH1N_PA7_1 CH32X035_PINMUX_DEFINE(PA, 7, TIM1, 1)
#define TIM1_CH1N_PB6_2 CH32X035_PINMUX_DEFINE(PB, 6, TIM1, 2)
#define TIM1_CH1N_PC5_3 CH32X035_PINMUX_DEFINE(PC, 5, TIM1, 3)
#define TIM1_CH2N_PB7_0 CH32X035_PINMUX_DEFINE(PB, 7, TIM1, 0)
#define TIM1_CH2N_PB0_1 CH32X035_PINMUX_DEFINE(PB, 0, TIM1, 1)
#define TIM1_CH2N_PB7_2 CH32X035_PINMUX_DEFINE(PB, 7, TIM1, 2)
#define TIM1_CH2N_PC6_3 CH32X035_PINMUX_DEFINE(PC, 6, TIM1, 3)
#define TIM1_CH3N_PB8_0 CH32X035_PINMUX_DEFINE(PB, 8, TIM1, 0)
#define TIM1_CH3N_PB1_1 CH32X035_PINMUX_DEFINE(PB, 1, TIM1, 1)
#define TIM1_CH3N_PB8_2 CH32X035_PINMUX_DEFINE(PB, 8, TIM1, 2)
#define TIM1_CH3N_PC7_3 CH32X035_PINMUX_DEFINE(PC, 7, TIM1, 3)

#define TIM2_ETR_PA19_0  CH32X035_PINMUX_DEFINE(PA, 19, TIM2, 0)
#define TIM2_ETR_PA18_1  CH32X035_PINMUX_DEFINE(PA, 18, TIM2, 1)
#define TIM2_ETR_PA19_2  CH32X035_PINMUX_DEFINE(PA, 19, TIM2, 2)
#define TIM2_ETR_PA18_3  CH32X035_PINMUX_DEFINE(PA, 18, TIM2, 3)
#define TIM2_ETR_PC4_4   CH32X035_PINMUX_DEFINE(PC, 4, TIM2, 4)
#define TIM2_ETR_PA2_5   CH32X035_PINMUX_DEFINE(PA, 2, TIM2, 5)
#define TIM2_ETR_PA2_6   CH32X035_PINMUX_DEFINE(PA, 2, TIM2, 6)
#define TIM2_CH1_PA0_0   CH32X035_PINMUX_DEFINE(PA, 0, TIM2, 0)
#define TIM2_CH1_PB21_1  CH32X035_PINMUX_DEFINE(PB, 21, TIM2, 1)
#define TIM2_CH1_PA0_2   CH32X035_PINMUX_DEFINE(PA, 0, TIM2, 2)
#define TIM2_CH1_PB21_3  CH32X035_PINMUX_DEFINE(PB, 21, TIM2, 3)
#define TIM2_CH1_PB16_4  CH32X035_PINMUX_DEFINE(PB, 16, TIM2, 4)
#define TIM2_CH1_PC19_5  CH32X035_PINMUX_DEFINE(PC, 19, TIM2, 5)
#define TIM2_CH1_PC19_6  CH32X035_PINMUX_DEFINE(PC, 19, TIM2, 6)
#define TIM2_CH2_PA1_0   CH32X035_PINMUX_DEFINE(PA, 1, TIM2, 0)
#define TIM2_CH2_PB15_1  CH32X035_PINMUX_DEFINE(PB, 16, TIM2, 1)
#define TIM2_CH2_PA1_2   CH32X035_PINMUX_DEFINE(PA, 1, TIM2, 2)
#define TIM2_CH2_PB15_3  CH32X035_PINMUX_DEFINE(PB, 15, TIM2, 3)
#define TIM2_CH2_PB17_4  CH32X035_PINMUX_DEFINE(PB, 17, TIM2, 4)
#define TIM2_CH2_PA12_5  CH32X035_PINMUX_DEFINE(PA, 12, TIM2, 5)
#define TIM2_CH2_PC14_6  CH32X035_PINMUX_DEFINE(PC, 14, TIM2, 6)
#define TIM2_CH3_PA2_0   CH32X035_PINMUX_DEFINE(PA, 2, TIM2, 0)
#define TIM2_CH3_PA2_1   CH32X035_PINMUX_DEFINE(PA, 2, TIM2, 1)
#define TIM2_CH3_PB3_2   CH32X035_PINMUX_DEFINE(PB, 3, TIM2, 2)
#define TIM2_CH3_PB3_3   CH32X035_PINMUX_DEFINE(PB, 3, TIM2, 3)
#define TIM2_CH3_PB18_4  CH32X035_PINMUX_DEFINE(PB, 18, TIM2, 4)
#define TIM2_CH3_PA13_5  CH32X035_PINMUX_DEFINE(PA, 13, TIM2, 5)
#define TIM2_CH3_PC15_6  CH32X035_PINMUX_DEFINE(PC, 15, TIM2, 6)
#define TIM2_CH4_PA3_0   CH32X035_PINMUX_DEFINE(PA, 3, TIM2, 0)
#define TIM2_CH4_PA3_1   CH32X035_PINMUX_DEFINE(PA, 3, TIM2, 1)
#define TIM2_CH4_PB4_2   CH32X035_PINMUX_DEFINE(PB, 4, TIM2, 2)
#define TIM2_CH4_PB4_3   CH32X035_PINMUX_DEFINE(PB, 4, TIM2, 3)
#define TIM2_CH4_PB19_4  CH32X035_PINMUX_DEFINE(PB, 19, TIM2, 4)
#define TIM2_CH4_PC0_5   CH32X035_PINMUX_DEFINE(PC, 0, TIM2, 5)
#define TIM2_CH4_PC0_6   CH32X035_PINMUX_DEFINE(PC, 0, TIM2, 6)
#define TIM2_BKIN_PA20_0 CH32X035_PINMUX_DEFINE(PA, 20, TIM2, 0)
#define TIM2_BKIN_PA9_1  CH32X035_PINMUX_DEFINE(PA, 9, TIM2, 1)
#define TIM2_BKIN_PA20_2 CH32X035_PINMUX_DEFINE(PA, 20, TIM2, 2)
#define TIM2_BKIN_PA9_3  CH32X035_PINMUX_DEFINE(PA, 9, TIM2, 3)
#define TIM2_BKIN_PC0_4  CH32X035_PINMUX_DEFINE(PC, 0, TIM2, 4)
#define TIM2_BKIN_PB4_5  CH32X035_PINMUX_DEFINE(PB, 4, TIM2, 5)
#define TIM2_BKIN_PB4_6  CH32X035_PINMUX_DEFINE(PB, 4, TIM2, 6)
#define TIM2_CH1N_PA21_0 CH32X035_PINMUX_DEFINE(PA, 21, TIM2, 0)
#define TIM2_CH1N_PA12_1 CH32X035_PINMUX_DEFINE(PA, 12, TIM2, 1)
#define TIM2_CH1N_PC3_2  CH32X035_PINMUX_DEFINE(PC, 3, TIM2, 2)
#define TIM2_CH1N_PA12_3 CH32X035_PINMUX_DEFINE(PA, 12, TIM2, 3)
#define TIM2_CH1N_PC1_4  CH32X035_PINMUX_DEFINE(PC, 1, TIM2, 4)
#define TIM2_CH1N_PC18_5 CH32X035_PINMUX_DEFINE(PC, 18, TIM2, 5)
#define TIM2_CH1N_PB11_6 CH32X035_PINMUX_DEFINE(PB, 11, TIM2, 6)
#define TIM2_CH2N_PA22_0 CH32X035_PINMUX_DEFINE(PA, 22, TIM2, 0)
#define TIM2_CH2N_PA13_1 CH32X035_PINMUX_DEFINE(PA, 13, TIM2, 1)
#define TIM2_CH2N_PA22_2 CH32X035_PINMUX_DEFINE(PA, 22, TIM2, 2)
#define TIM2_CH2N_PA13_3 CH32X035_PINMUX_DEFINE(PA, 13, TIM2, 3)
#define TIM2_CH2N_PC2_4  CH32X035_PINMUX_DEFINE(PC, 2, TIM2, 4)
#define TIM2_CH2N_PB12_5 CH32X035_PINMUX_DEFINE(PB, 12, TIM2, 5)
#define TIM2_CH2N_PB12_6 CH32X035_PINMUX_DEFINE(PB, 12, TIM2, 6)
#define TIM2_CH3N_PA23_0 CH32X035_PINMUX_DEFINE(PA, 23, TIM2, 0)
#define TIM2_CH3N_PA14_1 CH32X035_PINMUX_DEFINE(PA, 14, TIM2, 1)
#define TIM2_CH3N_PA23_2 CH32X035_PINMUX_DEFINE(PA, 23, TIM2, 2)
#define TIM2_CH3N_PA14_3 CH32X035_PINMUX_DEFINE(PA, 14, TIM2, 3)
#define TIM2_CH3N_PC3_4  CH32X035_PINMUX_DEFINE(PC, 3, TIM2, 4)
#define TIM2_CH3N_PB3_5  CH32X035_PINMUX_DEFINE(PB, 3, TIM2, 5)
#define TIM2_CH3N_PB3_6  CH32X035_PINMUX_DEFINE(PB, 3, TIM2, 6)

#define TIM3_CH1_PA6_0  CH32X035_PINMUX_DEFINE(PA, 6, TIM3, 0)
#define TIM3_CH1_PB4_1  CH32X035_PINMUX_DEFINE(PB, 4, TIM3, 1)
#define TIM3_CH1_PC19_2 CH32X035_PINMUX_DEFINE(PC, 19, TIM3, 2)
#define TIM3_CH1_PA3_3  CH32X035_PINMUX_DEFINE(PA, 3, TIM3, 3)
#define TIM3_CH2_PA7_0  CH32X035_PINMUX_DEFINE(PA, 7, TIM3, 0)
#define TIM3_CH2_PB5_1  CH32X035_PINMUX_DEFINE(PB, 5, TIM3, 1)
#define TIM3_CH2_PC18_2 CH32X035_PINMUX_DEFINE(PC, 18, TIM3, 2)
#define TIM3_CH2_PA4_3  CH32X035_PINMUX_DEFINE(PA, 4, TIM3, 3)

#define PIOC_0_PC18_0 CH32X035_PINMUX_DEFINE(PC, 18, PIOC, 0)
#define PIOC_0_PC7_1  CH32X035_PINMUX_DEFINE(PC, 7, PIOC, 1)
#define PIOC_1_PC19_0 CH32X035_PINMUX_DEFINE(PC, 19, PIOC, 0)
#define PIOC_1_PC19_1 CH32X035_PINMUX_DEFINE(PC, 19, PIOC, 1)

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_CH32X035_PINCTRL_H_ */
